tutorials/fsi/beamInCrossFlow2D/fluid/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
  // Block vorne unten
  (0 0 0) // 0
  (3 0 0) // 1
  (3 0 1) // 2
  (0 0 1) // 3
  (0 2 0) // 4
  (3 2 0) // 5
  (3 2 1) // 6
  (0 2 1) // 7
  // Block vorne oben
  (0 4 0) // 8
  (3 4 0) // 9
  (3 4 1) // 10
  (0 4 1) // 11
  // // Block mitte oben
  (4 2 0) // 12
  (4 2 1) // 13
  (4 4 0) // 14
  (4 4 1) // 15
  // // Block rechts unten
  (4 0 0)  // 16
  (10 0 0) // 17
  (10 0 1) // 18
  (4 0 1) // 19
  (10 2 0) // 20
  (10 2 1) // 21
  // // Block rechts oben
  (10 4 0) // 22
  (10 4 1) // 23
  );

blocks
(
    hex (0 1 5 4 3 2 6 7) (24 16 1) simpleGrading (1 1 1)
    hex (4 5 9 8 7 6 10 11) (24 16 1) simpleGrading (1 1 1)
    hex (5 12 14 9 6 13 15 10) (8 16 1) simpleGrading (1 1 1)
    hex (16 17 20 12 19 18 21 13) (48 16 1) simpleGrading (1 1 1)
    hex (12 20 22 14 13 21 23 15) (48 16 1) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch inlet
    (
        (0 3 7 4)
        (4 7 11 8)
    )
    patch outlet
    (
        (17 18 21 20)
        (20 21 23 22)
    )
    wall top
    (
        (8 9 10 11)
        (9 14 15 10)
        (14 22 23 15)
    )
    wall bottom
    (
        (0 1 2 3)
        (16 17 18 19)
    )
    empty left
    (
        (3 2 6 7)
        (7 6 10 11)
        (6 13 15 10)
        (19 18 21 13)
        (13 21 23 15)
    )

    empty right
    (
        (0 1 5 4)
        (4 5 9 8)
        (5 12 14 9)
        (16 17 20 12)
        (12 20 22 14)
    )
    wall interface
    (
        (1 2 6 5)
        (5 12 13 6)
        (16 19 13 12)
   )
);

mergePatchPairs
(
);

// ************************************************************************* //
