tutorials/fsi/beamInCrossFlow2D/fluid/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default bdf2;
}

gradSchemes
{
    default Gauss linear;
}

divSchemes
{
    default         Gauss linear;
}

laplacianSchemes
{
    default         Gauss linear corrected 1;
}

interpolationSchemes
{
    default linear;
}

snGradSchemes
{
    default corrected 1;
}

fluxRequired
{
    default         no;
    p;
}


// ************************************************************************* //
