tutorials/fsi/beamInCrossFlow2D/fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     3.0                                |
|   \\  /    A nd           | Web:         http://www.extend-project.de       |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      solver           PCG;
      preconditioner   DIC;
      tolerance        1e-15;
      relTol           1.0e-3;
    }

    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-15;
    }
}

PIMPLE
{
    nCorrectors 5;
    nNonOrthogonalCorrectors 0;
    tolerance 1.0e-13;
    relTol 1.0e-5;
    maxIter 5;
    minIter 1;
}

// ************************************************************************* //
